#+TODO: TODO DOSUB | DONE CANCELED 

* Time Align Mobile
  :LOGBOOK:
  CLOCK: [2018-09-21 Fri 07:39]--[2018-09-21 Fri 07:40] =>  0:01
  CLOCK: [2018-08-29 Wed 14:41]--[2018-08-29 Wed 14:46] =>  0:05
  CLOCK: [2018-08-19 Sun 16:05]--[2018-08-19 Sun 16:09] =>  0:04
  CLOCK: [2018-08-19 Sun 15:56]--[2018-08-19 Sun 16:05] =>  0:09
  CLOCK: [2018-08-18 Sat 15:07]--[2018-08-18 Sat 15:11] =>  0:04
  CLOCK: [2018-07-17 Tue 18:58]--[2018-07-17 Tue 19:17] =>  0:19
  :END:

** DONE Init the Project
   CLOSED: [2018-06-09 Sat 17:00]

#+BEGIN_SRC bash
justin@justin-thinkpad:~/projects/project-init$ docker run -ti -v $HOME/projects/project-init:/usr/app lein-init-project lein new expo time-align-mobile
Retrieving expo/lein-template/0.26.2/lein-template-0.26.2.pom from clojars
Retrieving expo/lein-template/0.26.2/lein-template-0.26.2.jar from clojars
Generating fresh Expo project.
README.md contains instructions to get you started.
If you have any questions, you can ask us on Clojurians #cljsrn channel. http://clojurians.net
justin@justin-thinkpad:~/projects/project-init$ sudo chown -R justin time-align-mobile/
justin@justin-thinkpad:~/projects/project-init$ sudo chgrp -R justin time-align-mobile/
justin@justin-thinkpad:~/projects/project-init$ ls -la
total 28
drwxrwxr-x  4 justin justin 4096 May 12 14:41 .
drwxrwxr-x 13 justin justin 4096 May 12 14:40 ..
-rw-rw-r--  1 justin justin  553 Mar 31 16:37 boot-initer.dockerfile
drwxrwxr-x  7 justin justin 4096 Apr  3 18:25 .git
-rw-rw-r--  1 justin justin  556 May 12 14:01 lein-initer.dockerfile
-rw-rw-r--  1 justin justin  328 Feb  2 13:53 pdfgrep.docker
drwxr-xr-x  6 justin justin 4096 May 12 14:41 time-align-mobile
justin@justin-thinkpad:~/projects/project-init$ mv time-align-mobile/ ../
#+END_SRC

** DONE Initial app-db
   CLOSED: [2018-06-09 Sat 17:00]

*** DONE Spec (no generation)
    CLOSED: [2018-06-09 Sat 17:00]

*** DONE Default DB
    CLOSED: [2018-06-09 Sat 17:00]

** DONE Set up navigation to each stub page
   CLOSED: [2018-06-12 Tue 20:52]

** DONE Define components
   CLOSED: [2018-06-12 Tue 21:06]
  :LOGBOOK:
  CLOCK: [2018-06-12 Tue 21:01]--[2018-06-12 Tue 21:06] =>  0:05
  CLOCK: [2018-06-12 Tue 20:55]--[2018-06-12 Tue 21:01] =>  0:06
  :END:

** DOSUB Screens
*** DONE Bucket form
    CLOSED: [2018-08-18 Sat 14:52]
    :LOGBOOK:
    CLOCK: [2018-07-17 Tue 18:44]--[2018-07-17 Tue 18:54] =>  0:10
    :END:

**** DONE Color
     CLOSED: [2018-07-17 Tue 09:21]
      :LOGBOOK:
      CLOCK: [2018-07-17 Tue 08:45]--[2018-07-17 Tue 09:21] =>  0:36
      CLOCK: [2018-07-17 Tue 07:54]--[2018-07-17 Tue 08:23] =>  0:29
      :END:
Chose [[https://github.com/instea/react-native-color-picker][this]] over [[https://github.com/hectahertz/react-native-color][that]] because this seemed more /self contained/.
This doesn't work well in a scroll view though so using the [[https://facebook.github.io/react-native/docs/modal][modal]] to contain it.
I like the soft rule that modals are only used to get a user's attention but in this case it is necessary to circumvent a bug and roll out the feature faster.
The color picker can be swapped out later.

**** DONE Time stamp
     CLOSED: [2018-07-21 Sat 15:28] SCHEDULED: <2018-07-18 Wed>
     :LOGBOOK:
     CLOCK: [2018-07-21 Sat 12:16]--[2018-07-21 Sat 14:28] =>  2:12
     CLOCK: [2018-07-18 Wed 07:40]--[2018-07-18 Wed 08:45] =>  1:05
     :END:
[[https://www.npmjs.com/package/react-native-modal-datetime-picker][date time picker]]

**** DONE Refactor form a bit
     CLOSED: [2018-07-21 Sat 16:05]
     :LOGBOOK:
     CLOCK: [2018-07-21 Sat 15:51]--[2018-07-21 Sat 16:05] =>  0:14
     CLOCK: [2018-07-21 Sat 14:49]--[2018-07-21 Sat 15:27] =>  0:38
     CLOCK: [2018-07-21 Sat 15:28]--[2018-07-21 Sat 15:29] =>  0:01
     :END:
- Added remaining fields
- each field into its own function
- styles

*** DONE Period form
    CLOSED: [2018-08-18 Sat 14:52]
    :LOGBOOK:
    CLOCK: [2018-07-21 Sat 18:07]--[2018-07-21 Sat 18:59] =>  0:52
    :END:

**** DONE Copy and paste subs/handlers/comps
     CLOSED: [2018-07-22 Sun 11:56]
     :LOGBOOK:
     CLOCK: [2018-07-21 Sat 18:45]--[2018-07-21 Sat 19:00] =>  0:15
     :END:

**** DONE Add some periods to default db
     CLOSED: [2018-07-22 Sun 12:34]
     :LOGBOOK:
     CLOCK: [2018-07-22 Sun 11:56]--[2018-07-22 Sun 12:17] =>  0:21
     :END:

**** DONE Load a period from drawer
     CLOSED: [2018-07-22 Sun 12:46]
     :LOGBOOK:
     CLOCK: [2018-07-22 Sun 12:34]--[2018-07-22 Sun 12:46] =>  0:12
     :END:

**** DONE Static fields
     CLOSED: [2018-07-22 Sun 14:10]
     :LOGBOOK:
     CLOCK: [2018-07-22 Sun 12:55]--[2018-07-22 Sun 14:10] =>  1:15
     :END:
- [X] Id
- [X] Created
- [X] Last edited
- [X] Update load period form handler for parent fields
- [X] Parent ID
- [X] Parent label
- [X] Parent color

**** DONE Dynamic fields
     CLOSED: [2018-07-29 Sun 08:32]
     :LOGBOOK:
     CLOCK: [2018-07-29 Sun 07:41]--[2018-07-29 Sun 08:32] =>  0:51
     CLOCK: [2018-07-26 Thu 07:44]--[2018-07-26 Thu 08:00] =>  0:16
     CLOCK: [2018-07-25 Wed 08:00]--[2018-07-25 Wed 09:37] =>  1:37
     CLOCK: [2018-07-24 Tue 08:33]--[2018-07-24 Tue 08:45] =>  0:12
     CLOCK: [2018-07-24 Tue 08:30]--[2018-07-24 Tue 08:32] =>  0:02
     CLOCK: [2018-07-23 Mon 08:13]--[2018-07-23 Mon 08:53] =>  0:40
     CLOCK: [2018-07-23 Mon 07:30]--[2018-07-23 Mon 07:45] =>  0:15
     :END:
- [X] Label
- [X] Planned
- [X] Start
- [X] Stop
- [X] Parent Picker
  - To save look into pull out the period with specter and setting the value in the bucket as null
  - Then saving it under whatever the id is in the form
  - Shouldn't matter if it doesn't change

*** DONE Template form
    CLOSED: [2018-08-18 Sat 14:52]
    :LOGBOOK:
    CLOCK: [2018-07-29 Sun 09:40]--[2018-07-29 Sun 10:08] =>  0:28
    CLOCK: [2018-07-29 Sun 08:54]--[2018-07-29 Sun 09:16] =>  0:22
    :END:
- [X] Started fields
- [X] Started handlers
- [X] Started subscribers

**** DONE Fix db spec
     CLOSED: [2018-08-05 Sun 11:26]
     :LOGBOOK:
     CLOCK: [2018-08-03 Fri 07:51]--[2018-08-03 Fri 08:28] =>  0:37
     :END:
Needed to put templates in a collection inside the buckets

**** DONE Fix start component
     CLOSED: [2018-08-05 Sun 11:26]
     :LOGBOOK:
     CLOCK: [2018-08-05 Sun 11:07]--[2018-08-05 Sun 11:26] =>  0:19
     CLOCK: [2018-08-05 Sun 10:48]--[2018-08-05 Sun 10:55] =>  0:07
     CLOCK: [2018-08-03 Fri 08:28]--[2018-08-03 Fri 08:43] =>  0:15
     :END:

**** DONE Add remaining form comps
     CLOSED: [2018-08-05 Sun 11:35]
     :LOGBOOK:
     CLOCK: [2018-08-05 Sun 11:26]--[2018-08-05 Sun 11:35] =>  0:09
     :END:

**** DONE Add duration component
     CLOSED: [2018-09-02 Sun 14:21]
     :LOGBOOK:
     CLOCK: [2018-09-02 Sun 13:46]--[2018-09-02 Sun 14:21] =>  0:35
     :END:

*** DONE Templates list
    CLOSED: [2018-08-19 Sun 15:56]
    :LOGBOOK:
    CLOCK: [2018-08-05 Sun 12:03]--[2018-08-05 Sun 13:05] =>  1:02
    :END:

**** DONE Navigate to form
     CLOSED: [2018-08-11 Sat 18:00]
     :LOGBOOK:
     CLOCK: [2018-08-11 Sat 17:35]--[2018-08-11 Sat 18:00] =>  0:25
     :END:

*** DONE Periods list
    CLOSED: [2018-08-19 Sun 15:56]
    :LOGBOOK:
    CLOCK: [2018-08-19 Sun 10:25]--[2018-08-19 Sun 10:26] =>  0:01
    CLOCK: [2018-08-19 Sun 10:26]--[2018-08-19 Sun 10:57] =>  0:31
    :END:

**** Flat list of periods
**** Filter component
*** DONE Bucket list
    CLOSED: [2018-08-19 Sun 15:56]
    :LOGBOOK:
    CLOCK: [2018-08-19 Sun 11:29]--[2018-08-19 Sun 11:38] =>  0:09
    :END:

*** DONE Filter list
    CLOSED: [2018-08-26 Sun 11:27]
    :LOGBOOK:
    CLOCK: [2018-08-26 Sun 10:58]--[2018-08-26 Sun 11:27] =>  0:29
    :END:
Should it use filters?
- [X] Add entry to navigation

*** DOSUB Day
    :LOGBOOK:
    CLOCK: [2018-09-21 Fri 07:40]--[2018-09-21 Fri 08:10] =>  0:30
    :END:

**** DOSUB Display
     :LOGBOOK:
     :END:

***** DONE Explore and research
      CLOSED: [2018-10-27 Sat 15:30]
      :LOGBOOK:
      CLOCK: [2018-10-07 Sun 15:40]--[2018-10-07 Sun 17:15] =>  1:35
      CLOCK: [2018-10-07 Sun 15:26]--[2018-10-07 Sun 15:40] =>  0:14
      CLOCK: [2018-10-07 Sun 11:56]--[2018-10-07 Sun 12:31] =>  0:35
      CLOCK: [2018-10-07 Sun 11:18]--[2018-10-07 Sun 11:35] =>  0:17
      CLOCK: [2018-10-04 Thu 09:14]--[2018-10-04 Thu 09:14] =>  0:00
      CLOCK: [2018-10-04 Thu 07:45]--[2018-10-04 Thu 09:11] =>  1:26
      CLOCK: [2018-10-02 Tue 07:11]--[2018-10-02 Tue 08:55] =>  1:44
      CLOCK: [2018-09-22 Sat 14:17]--[2018-09-22 Sat 14:38] =>  0:21
      :END:
- [X] Render a view that knows its height (using the guides below)
  - [[https://stackoverflow.com/questions/33770901/how-to-get-size-of-a-component-in-react-native/33771254][Get height of view]] (did not need this)
  - [[https://cmichel.io/how-to-get-the-size-of-a-react-native-view-dynamically][Doing exactly what I want]]
- [X] Drag n drop poc
  - [[https://blog.reactnativecoach.com/creating-draggable-component-with-react-native-132d30c27cb0][Drag n drop guide]]
  - [[https://gist.github.com/saukap/7b5ed374f7aba148815acef4b7dd3feb][And a little of this gist]]
- [X] Verify that known height and pan responder can translate to times

***** DOSUB Get down to it
      :LOGBOOK:
      CLOCK: [2018-10-07 Sun 19:55]--[2018-10-07 Sun 19:59] =>  0:04
      :END:

****** DONE Period display function
       CLOSED: [2018-10-13 Sat 13:56] SCHEDULED: <2018-10-13 Sat>
       :LOGBOOK:
       CLOCK: [2018-10-13 Sat 12:09]--[2018-10-13 Sat 13:56] =>  1:47
       CLOCK: [2018-10-13 Sat 11:30]--[2018-10-13 Sat 11:40] =>  0:10
       CLOCK: [2018-10-13 Sat 09:49]--[2018-10-13 Sat 10:00] =>  0:11
       CLOCK: [2018-10-08 Mon 07:21]--[2018-10-08 Mon 08:11] =>  0:50
       :END:

****** DONE Period selection
       CLOSED: [2018-10-13 Sat 14:21] SCHEDULED: <2018-10-13 Sat>
       :LOGBOOK:
       CLOCK: [2018-10-13 Sat 13:56]--[2018-10-13 Sat 14:21] =>  0:25
       :END:

****** DOSUB Selection display
       :LOGBOOK:
       CLOCK: [2018-10-18 Thu 17:48]--[2018-10-18 Thu 18:14] =>  0:26
       CLOCK: [2018-10-13 Sat 19:03]--[2018-10-13 Sat 19:04] =>  0:01
       :END:
- Separate the display info|actions
  - Make info scrollable
  - Actions should be absolutely sized
- Use zstring editor for info

******* DONE Orient and position the display
        CLOSED: [2018-10-13 Sat 19:53]
        :LOGBOOK:
        CLOCK: [2018-10-13 Sat 19:04]--[2018-10-13 Sat 19:33] =>  0:49
        :END:

******* DONE Info section
        CLOSED: [2018-10-13 Sat 20:00]
        :LOGBOOK:
        CLOCK: [2018-10-13 Sat 19:33]--[2018-10-13 Sat 19:55] =>  0:22
         CLOCK: [2018-10-14 Sun 16:03]--[2018-10-14 Sun 16:49] =>  0:46
        :END:

******* DOSUB Selection menu
        :LOGBOOK:
        CLOCK: [2018-11-17 Sat 11:50]--[2018-11-17 Sat 11:50] =>  0:00
        CLOCK: [2018-10-18 Thu 18:14]--[2018-10-18 Thu 19:01] =>  0:47
        :END:

******** DONE Edit
         CLOSED: [2018-10-13 Sat 20:00]
         :LOGBOOK:
         CLOCK: [2018-10-13 Sat 19:55]--[2018-10-13 Sat 20:00] =>  0:05
         :END:

******** DONE Setup icons
         CLOSED: [2018-10-14 Sun 17:11]
         :LOGBOOK:
         CLOCK: [2018-10-14 Sun 16:49]--[2018-10-14 Sun 17:11] =>  0:22
         :END:

******** DONE Cancel
         CLOSED: [2018-10-27 Sat 15:30]
         :LOGBOOK:
         CLOCK: [2018-10-14 Sun 17:11]--[2018-10-14 Sun 17:24] =>  0:13
         :END:

******** DONE Move up (w/ long press)
         CLOSED: [2018-11-04 Sun 16:06] SCHEDULED: <2018-11-04 Sun>
         :LOGBOOK:
         CLOCK: [2018-11-04 Sun 15:25]--[2018-11-04 Sun 16:06] =>  0:41
         CLOCK: [2018-10-27 Sat 15:30]--[2018-10-27 Sat 16:01] =>  0:31
         CLOCK: [2018-10-13 Sat 20:02]--[2018-10-13 Sat 20:09] =>  0:07
         :END:
- [X] Handler & button
- [X] Fix wrapping around on day view
- [X] Add long press
- [X] Change icon

******** DONE Move down (w/ long press)
         CLOSED: [2018-11-04 Sun 16:14]
         :LOGBOOK:
         CLOCK: [2018-11-04 Sun 16:06]--[2018-11-04 Sun 16:14] =>  0:08
         :END:

******** DONE Expand from stop (w/ long press)
         CLOSED: [2018-11-04 Sun 16:23]
         :LOGBOOK:
         CLOCK: [2018-11-04 Sun 16:14]--[2018-11-04 Sun 16:23] =>  0:09
         :END:

******** DONE Expand from start (w/ long press)
         CLOSED: [2018-11-04 Sun 16:31]
         :LOGBOOK:
         CLOCK: [2018-11-04 Sun 16:25]--[2018-11-04 Sun 16:31] =>  0:06
         :END:

******** DONE Contract from stop (w/ long press)
         CLOSED: [2018-11-04 Sun 16:25]
         :LOGBOOK:
         CLOCK: [2018-11-04 Sun 16:24]--[2018-11-04 Sun 16:25] =>  0:01
         :END:

******** DONE Contract from start (w/ long press)
         CLOSED: [2018-11-04 Sun 16:31]

******** DONE Copy to other side
         CLOSED: [2018-11-05 Mon 07:24]
         :LOGBOOK:
         CLOCK: [2018-11-05 Mon 06:56]--[2018-11-05 Mon 07:24] =>  0:28
         :END:

******** DONE Move to tomorrow
         CLOSED: [2018-11-11 Sun 18:04]
         :LOGBOOK:
         CLOCK: [2018-11-11 Sun 18:03]--[2018-11-11 Sun 18:03] =>  0:00
         CLOCK: [2018-11-11 Sun 16:27]--[2018-11-11 Sun 16:42] =>  0:15
         :END:

******** DONE Move to yesterday & Both copies
         CLOSED: [2018-11-11 Sun 19:15]
         :LOGBOOK:
         CLOCK: [2018-11-11 Sun 18:29]--[2018-11-11 Sun 18:48] =>  0:19
         :END:

******** DOSUB Select next / prev
         :LOGBOOK:
         CLOCK: [2018-11-17 Sat 15:54]--[2018-11-17 Sat 16:28] =>  0:34
         CLOCK: [2018-11-17 Sat 14:06]--[2018-11-17 Sat 14:34] =>  0:28
         CLOCK: [2018-11-17 Sat 11:46]--[2018-11-17 Sat 11:47] =>  0:01
         CLOCK: [2018-11-11 Sun 19:22]--[2018-11-11 Sun 19:25] =>  0:03
         :END:

********* DOSUB Need to take into account
********** TODO Displayed day

 Displayed day isn't represented in app-db so that needs to be taken care of first.
 Then it should be straight forward to use it as a filter in the select next handler.

********** Planned

Needs to stay in the same track as the currently selected period with a sane default

******** DONE Button groups
         CLOSED: [2019-01-27 Sun 19:27]
         :LOGBOOK:
         CLOCK: [2019-01-27 Sun 16:53]--[2019-01-27 Sun 19:27] =>  2:34
         :END:

- Movement
- Transformations
- Copying
- misc not in a group

******** DONE Play / Pause
         CLOSED: [2018-12-01 Sat 17:50]

********* Brainstorming
          :LOGBOOK:
          CLOCK: [2018-11-13 Tue 07:28]--[2018-11-13 Tue 07:30] =>  0:02
          CLOCK: [2018-11-13 Tue 07:27]--[2018-11-13 Tue 07:28] =>  0:01
          CLOCK: [2018-11-13 Tue 07:20]--[2018-11-13 Tue 07:27] =>  0:07
          :END:
Need to use [[https://facebook.github.io/react-native/docs/appstate][appstate]] to detect when the app comes into the foreground. 
Appstate and appstate change handler can be in the app-db and reframe handlers.
Selecting a period to be played can have a top level app-db entry of ={:in-play-period uuid :time-started js/Date}=.
The handler will update the playing period whenever the app is transitioning to the foreground.
A [[https://facebook.github.io/react-native/docs/timers][Timer interval]] will be set while the app is in the foreground. The id should be stored in app-state.
When the appstate changes to the background, the handler should clear the interval.

********* Checklist
          :LOGBOOK:
          CLOCK: [2018-11-17 Sat 17:48]--[2018-11-17 Sat 19:12] =>  1:24
          CLOCK: [2018-11-17 Sat 16:43]--[2018-11-17 Sat 17:14] =>  0:31
          CLOCK: [2018-11-13 Tue 07:30]--[2018-11-13 Tue 07:34] =>  0:04
          :END:
- [X] Add appstate to app-db
- [X] Add appstate handler
- [X] Add appstate subscription
- [X] Add a change event registration at the root of the app
- [X] Prove that appstate is working (console log changes)
- [X] Add play state to app-db
- [X] Make handler update period
- [ ] Add interval for updating while in foreground
- [ ] Make handler clear interval when the appstate changes to background

********* Oh, wait
          :LOGBOOK:
          CLOCK: [2018-11-18 Sun 18:52]--[2018-11-18 Sun 18:54] =>  0:02
          CLOCK: [2018-11-18 Sun 11:36]--[2018-11-18 Sun 15:03] =>  3:27
          CLOCK: [2018-11-17 Sat 19:12]--[2018-11-17 Sat 19:14] =>  0:02
          :END:
Pressing play on a selected period should create a new period that is not planned.
It starts now and stops 1 ms from now and is in play.
Maybe if a period is in play and small enough it should should a lighter /ahead view/.
- [X] Need to alter the play handler to do this.
- [X] Then verify that putting the app in the background and returning to the foreground triggers update.
- [ ] Then work on a running interval while the app is active that updates every few seconds or minute.
  - This is hard!

********* wait wait, no
          :LOGBOOK:
          CLOCK: [2018-11-25 Sun 12:55]--[2018-11-25 Sun 13:00] =>  0:05
          CLOCK: [2018-11-24 Sat 18:51]--[2018-11-24 Sat 19:54] =>  1:03
          CLOCK: [2018-11-24 Sat 16:54]--[2018-11-24 Sat 16:57] =>  0:03
          :END:
Start an initial timer on app-db init as a side effect. Use the same side effect in the handler for app-state change.
I guess genymotion decided recently to remove internet access for free version.
I can't access the expo bundler without connecting to the internet to see it running in the expo client.
Nvm I guess genymotion works fine now??

********* Experiment with timer
                  :LOGBOOK:
          CLOCK: [2018-11-25 Sun 13:00]--[2018-11-25 Sun 13:42] =>  0:42
          CLOCK: [2018-11-25 Sun 12:29]--[2018-11-25 Sun 13:00] =>  0:31
          :END:

********** Starting an interval timer at the top of a namespace
           :PROPERTIES:
           :COMMIT:   684992ab53d05edec413ee5a6d3d16ef0121fd7b
           :END:

Timer starts and runs just fine.
When hot reloading the timer does *not* get removed.
So each code change adds another interval timer.
Seems to work fine going in and out of foreground
#+BEGIN_SRC bash
[13:14:58] Done loading Clojure app
[13:14:58] Figwheel: trying to open cljs reload socket
[13:14:58] Figwheel: socket connection established
[13:15:02] 18:15:02 GMT+0000 (GMT)
[13:15:12] 18:15:12 GMT+0000 (GMT)
[13:15:17] 18:15:17 GMT+0000 (GMT)
[13:15:22] 18:15:22 GMT+0000 (GMT)
[13:15:27] 18:15:27 GMT+0000 (GMT)
[13:15:32] 18:15:32 GMT+0000 (GMT)
[13:15:37] 18:15:37 GMT+0000 (GMT)
[13:15:38] changed to background
[13:16:07] changed to active
[13:16:07] 18:16:07 GMT+0000 (GMT)
[13:16:12] 18:16:12 GMT+0000 (GMT)
[13:16:17] 18:16:17 GMT+0000 (GMT)
#+END_SRC

********** setTimeout on component mount
           :PROPERTIES:
           :COMMIT:   653bd530b02cae223bd5f839b38774dcb9c07239
           :END:
           :LOGBOOK:
           CLOCK: [2018-11-25 Sun 13:42]--[2018-11-25 Sun 14:36] =>  0:54
           :END:
Putting a timeout that updates a subscribed =r/atom= , at the top of a render function, keeps the update in a continuous cycle.
No interval is needed.
This works as expected when the app goes into the background. On resuming the timeout resumes, no buildup of timeouts that all get run at once. Interval didn't do that either though so I don't know why I mention it.
Hot reloading works too. At most one built up timeout will get run after the reload. It could in some specific circumstance cause a bug but quitting the app and restarting would fix it.

********* Let's Play
          :LOGBOOK:
          CLOCK: [2018-11-25 Sun 14:36]--[2018-11-25 Sun 16:44] =>  2:08
          :END:
- [X] At the top of root render function have a continuous set timeout
- [X] Timeout dispatch a =tick= event and update the current time atom
- [X] Day display gets current time passed down from atom
- [X] Change the set timeout to a set interval on app init 
  - Not concerned about clearing it
  - Happens once when the app starts
  - /Pauses/ when the app state transitions from active to background
  - Doesn't create multiple timers on hot reloading
- [X] Tick event checks for a =period-in-play= and updates it's stop time
- [X] Playing a selected period creates a new period and sets =period-in-play=

********* Finishing off playing
          :LOGBOOK:
          CLOCK: [2018-12-01 Sat 15:16]--[2018-12-01 Sat 17:50] =>  2:34
          CLOCK: [2018-11-25 Sun 16:44]--[2018-11-25 Sun 16:48] =>  0:04
          :END:
- [X] add some play buttons at the bottom
  - [X] Shows what is in play (opacity change)
  - [X] Selects in play period
  - [X] Stops in play period
  - [X] +At least make a note of: Play from nothing dialog+ Add modal for playing from
    - [X] +Moves through selecting a+ A bucket
    - [X] +Selecting a+ A period template

******** CANCELED Change the relationship between info and button sections
         CLOSED: [2019-01-27 Sun 19:28]

Only show UUID start and stop with an option to expand and show the rest.
Leaves more room for buttons, which should be bigger and arranged differently.

******* DONE Day navigator
        CLOSED: [2018-11-17 Sat 12:27]
        :LOGBOOK:
        CLOCK: [2018-11-17 Sat 11:50]--[2018-11-17 Sat 12:27] =>  0:37
        :END:

******* TODO Figure out how to handle overlapping periods

- Use a next / prev button in the menu
  - order periods by start
  - filter by start < or > then take the first 

*** DOSUB Report
**** TODO Summary
**** TODO Info
*** TODO Calendar
*** DOSUB Settings
**** TODO Data field mode
** DOSUB Reusable Components
*** DONE List action buttons
    CLOSED: [2018-08-29 Wed 14:45]

**** What could they do
     :LOGBOOK:
     CLOCK: [2018-08-19 Sun 11:43]--[2018-08-19 Sun 11:48] =>  0:05
     CLOCK: [2018-08-19 Sun 11:39]--[2018-08-19 Sun 11:43] =>  0:04
     :END:
- Add new items
  - Should that use the filter?
- Delete many selected items
- Copy many selected items (not +deep+ child periods?)
- Select/deselect all
- Remove periods/templates (just buckets)

**** What will they do (mvp)

Add

**** DONE Add button
     CLOSED: [2018-08-29 Wed 14:41]
     :LOGBOOK:
     CLOCK: [2018-08-29 Wed 14:12]--[2018-08-29 Wed 14:41] =>  0:29
     CLOCK: [2018-08-29 Wed 13:22]--[2018-08-29 Wed 13:59] =>  0:37
     CLOCK: [2018-08-28 Tue 14:47]--[2018-08-28 Tue 15:38] =>  0:51
     CLOCK: [2018-08-28 Tue 09:39]--[2018-08-28 Tue 10:52] =>  1:13
     CLOCK: [2018-08-28 Tue 08:55]--[2018-08-28 Tue 09:01] =>  0:06
     CLOCK: [2018-08-28 Tue 08:11]--[2018-08-28 Tue 08:40] =>  0:29
     CLOCK: [2018-08-28 Tue 07:46]--[2018-08-28 Tue 07:49] =>  0:03
     CLOCK: [2018-08-27 Mon 11:45]--[2018-08-27 Mon 12:28] =>  0:43
     :END:
- [X] Bucket
- [X] Period
- [X] Period from template
  - modal on period list +or from template list+
- [X] Template
- [X] Filter
- [-] Use filter to populate form

*** DONE Structured-data
    CLOSED: [2018-07-15 Sun 14:06]

*** DONE Form-buttons
    CLOSED: [2018-10-13 Sat 09:47] SCHEDULED: <2018-07-18 Wed>
    :LOGBOOK:
    CLOCK: [2018-07-23 Mon 07:45]--[2018-07-23 Mon 08:13] =>  0:28
    :END:

**** DONE Delete button
     CLOSED: [2018-08-30 Thu 17:00]
     :LOGBOOK:
     CLOCK: [2018-08-30 Thu 15:54]--[2018-08-30 Thu 17:00] =>  1:06
     CLOCK: [2018-08-30 Thu 14:25]--[2018-08-30 Thu 15:00] =>  0:35
     :END:

*** DONE Filter
    CLOSED: [2018-08-19 Sun 15:52]
    :LOGBOOK:
    CLOCK: [2018-08-05 Sun 13:58]--[2018-08-05 Sun 14:02] =>  0:04
    :END:

**** DONE Add spec and default for filter definitions
     CLOSED: [2018-08-11 Sat 17:15]
     :LOGBOOK:
     CLOCK: [2018-08-05 Sun 13:33]--[2018-08-05 Sun 13:57] =>  0:24
     :END:

**** DONE Add form
     CLOSED: [2018-08-11 Sat 13:59]
     :LOGBOOK:
     CLOCK: [2018-08-11 Sat 13:37]--[2018-08-11 Sat 13:59] =>  0:22
     CLOCK: [2018-08-11 Sat 12:08]--[2018-08-11 Sat 12:22] =>  0:14
     CLOCK: [2018-08-11 Sat 11:48]--[2018-08-11 Sat 11:55] =>  0:07
     CLOCK: [2018-08-11 Sat 08:07]--[2018-08-11 Sat 09:04] =>  0:57
     CLOCK: [2018-08-07 Tue 08:31]--[2018-08-07 Tue 09:13] =>  0:42
     CLOCK: [2018-08-07 Tue 07:48]--[2018-08-07 Tue 08:04] =>  0:16
     :END:
- [X] spec
- [X] default
- [X] screen
- [X] nav
- [X] fields
  - [X] everything but predicates
  - [X] predicates (switched to just a structured data text entry for same reasons as data field)
- [X] subs
- [X] handlers

**** DONE Add comp that sets active filter
     CLOSED: [2018-08-18 Sat 14:15]
     :LOGBOOK:
     CLOCK: [2018-08-18 Sat 12:39]--[2018-08-18 Sat 14:16] =>  1:37
     CLOCK: [2018-08-11 Sat 17:15]--[2018-08-11 Sat 17:35] =>  0:20
     CLOCK: [2018-08-11 Sat 13:59]--[2018-08-11 Sat 14:07] =>  0:08
     :END:
- [X] picker
- [X] subs
- [X] handlers

**** DONE Function that filters objects by active filter
     CLOSED: [2018-08-18 Sat 14:51]
     :LOGBOOK:
     CLOCK: [2018-08-18 Sat 14:16]--[2018-08-18 Sat 14:51] =>  0:35
     :END:

**** DONE Add sort
     CLOSED: [2018-08-19 Sun 15:52]
     :LOGBOOK:
     CLOCK: [2018-08-19 Sun 14:48]--[2018-08-19 Sun 15:52] =>  1:04
     :END:

**** DONE [#A] Compatible selection
     CLOSED: [2018-08-23 Thu 07:54]
     :LOGBOOK:
     CLOCK: [2018-08-23 Thu 06:59]--[2018-08-23 Thu 07:54] =>  0:55
     :END:

**** DONE Compatible filter on all list pages
     CLOSED: [2018-08-26 Sun 12:10]
     :LOGBOOK:
     CLOCK: [2018-08-26 Sun 11:28]--[2018-08-26 Sun 12:10] =>  0:42
     :END:

*** DONE Form fields
    CLOSED: [2018-08-23 Thu 07:04]
    :LOGBOOK:
    CLOCK: [2018-08-07 Tue 08:04]--[2018-08-07 Tue 08:31] =>  0:27
    :END:
Moved common fields to a reusable component space

*** TODO Time-nav
    :LOGBOOK:
    CLOCK: [2018-11-17 Sat 11:47]--[2018-11-17 Sat 11:49] =>  0:02
    :END:

*** TODO Time-range
** DOSUB Misc
   :LOGBOOK:
   CLOCK: [2019-03-16 Sat 13:07]--[2019-03-16 Sat 13:08] =>  0:01
   CLOCK: [2018-07-23 Mon 08:53]--[2018-07-23 Mon 08:54] =>  0:01
   :END:
*** DONE Add persistence to +async storage+ secure store
    CLOSED: [2018-12-02 Sun 17:50]
    :LOGBOOK:
    CLOCK: [2018-12-03 Mon 11:18]--[2018-12-03 Mon 11:18] =>  0:00
    CLOCK: [2018-12-02 Sun 16:31]--[2018-12-02 Sun 17:50] =>  1:19
    :END:

**** Debug
     :LOGBOOK:
     CLOCK: [2018-12-03 Mon 11:18]--[2018-12-03 Mon 13:41] =>  2:23
     :END:
Needed to use some =oops= functions and not write over the secure store with the db init.

*** CANCELED Handler validation and errors
    CLOSED: [2019-01-27 Sun 14:00]
    :LOGBOOK:
    CLOCK: [2018-07-24 Tue 08:09]--[2018-07-24 Tue 08:30] =>  0:21
    :END:
Should spec eval only be on dev?
How else can we validate handlers and alert the user when they fail?
Check and throw now returns old db if it fails

*** CANCELED Dragging periods
    CLOSED: [2019-01-27 Sun 14:00]
    :LOGBOOK:
    CLOCK: [2018-07-22 Sun 12:32]--[2018-07-22 Sun 12:34] =>  0:02
    CLOCK: [2018-07-22 Sun 12:17]--[2018-07-22 Sun 12:32] =>  0:15
    :END:
[[https://snack.expo.io/Syy1bqKxW][Example of panresponder]]
I think the panresponder with panhandlers would go on the containing svg element. 
Each svg child element would have [[https://github.com/react-native-community/react-native-svg#touch-events][touch events]] (=on-press-in= and =on-press-out=) that set and reset a /selected element/.
When the pan responder gets move events it takes the x & y positions, translates them to a time, and updates the /start/ and /stop/ on the /selected element/.
Translating the x & y to a time will be tricky. Will probably have to [[https://facebook.github.io/react-native/docs/dimensions][get device dimensions]] to set and know the absolute values of svg element.
Search =drag n drop poc= in day screen

*** DONE Refactor task to bucket
    CLOSED: [2018-07-22 Sun 11:56]
    :LOGBOOK:
    CLOCK: [2018-07-21 Sat 18:20]--[2018-07-21 Sat 18:40] =>  0:20
    :END:

*** DONE Time zone tinkering
    CLOSED: [2019-01-27 Sun 14:04]
    :LOGBOOK:
    CLOCK: [2019-01-27 Sun 14:01]--[2019-01-27 Sun 14:04] =>  0:03
    :END:

**** Initial thoughts

- persist all times in UTC with the local time zone that it was created in as a another field for display
- display times in the time zone they were created in
- when the local time zone is different than the stored /created timezone/ value then display the created time zone
- have an option to adjust per displayed time zone or a one button "update all forward" times to new local time zone

**** DONE Fucked around with async function to get the time zone of the device
     CLOSED: [2018-08-31 Fri 13:23]
     :LOGBOOK:
     CLOCK: [2018-08-31 Fri 13:19]--[2018-08-31 Fri 13:29] =>  0:10
     CLOCK: [2018-08-31 Fri 12:52]--[2018-08-31 Fri 13:19] =>  0:27
     CLOCK: [2018-08-31 Fri 11:00]--[2018-08-31 Fri 12:10] =>  1:10
     :END:
[[https://docs.expo.io/versions/latest/sdk/localization#expodangerzonelocalizationgetcurrenttimezoneasync][This function]] required a lot of trial and error [[https://funcool.github.io/promesa/latest/#introduction-2][from]] many [[https://github.com/funcool/promesa/blob/master/test/promesa/core_tests.cljc][sources]] to come up with:
#+BEGIN_SRC clojure
(require '[promesa.core :as p])
(def expo (js/require "expo"))
(def localization (->> expo (.-DangerZone) (.-Localization)))

(p/then (.getCurrentTimeZoneAsync localization) #(println %))

;; with async/await (lets you do sync stuff within async or p/alet)
(require '[promesa.async-cljs :refer-macros [async]])

;; idk why js/promise.resolve is there
(p/then (async (-> (.getCurrentTimeZoneAsync localization) js/Promise.resolve p/await)) #(println %))
#+END_SRC

**** Thoughts

Keep the device time zone in state.
Keep a display time zone.
Whenever it changes (if you can subscribe to that or just monitor each tick) then prompt the user.
- Change all times so that relative time is the same (new instant adjusted to the difference in time zones)
- Change all going forward
- Keep all instants but display in new time zone
- Keep all instants but display in old time zone?

*** DONE Hard MVP decisions
    CLOSED: [2018-08-18 Sat 14:53]
    :LOGBOOK:
    CLOCK: [2018-07-24 Tue 08:32]--[2018-07-24 Tue 08:33] =>  0:01
    :END:
- No styling except what is absolutely necessary
- Stopped structured data comp partway through for a large text field
- No backend or persistence
- No JSON export or structured data support until mvp

*** DONE Consider adding separate filters for buckets|templates|periods
    CLOSED: [2018-08-19 Sun 16:08]

Alternative might be to have a selection item in the form for which entities this filter is used for.
This would keep the pickers clean on the list screens and it would be filterable on the filter list page.

*** DONE Better default app-db(s)
    CLOSED: [2018-09-02 Sun 13:45]
    :LOGBOOK:
    CLOCK: [2018-09-02 Sun 13:03]--[2018-09-02 Sun 13:45] =>  0:42
    CLOCK: [2018-09-02 Sun 12:23]--[2018-09-02 Sun 12:37] =>  0:14
    :END:
- [-] Blank app-db
- [X] Test/demo app-db
- [-] Make toggle that depends on release channel

*** DONE Clean drawer
    CLOSED: [2018-09-08 Sat 06:01]
    :LOGBOOK:
    CLOCK: [2018-09-08 Sat 05:35]--[2018-09-08 Sat 06:01] =>  0:26
    CLOCK: [2018-09-04 Tue 08:02]--[2018-09-04 Tue 08:20] =>  0:18
    :END:
- remove form links
- re-order

*** DONE CRUD demo
    CLOSED: [2018-09-08 Sat 06:11]
    :LOGBOOK:
    CLOCK: [2018-09-08 Sat 06:01]--[2018-09-08 Sat 06:11] =>  0:10
    :END:
- [X] bucket
- [X] filter
- [X] blank period
- [X] template
- [X] period with template
Recording feature is not available in personal use genymotion. Just demoed to myself.

*** DONE Add tests for handlers
    CLOSED: [2018-09-20 Thu 08:56]

<2019-08-28 Wed>
initial tests written 
<2018-09-10 Mon>
Needed to refactor add handlers to be deterministic so that they were easier to test.
They should not have had random id generation and date creation to represent "now".
<2018-09-11 Tue>
Finished add handler tests. Total handler tests (15/28).
Also researched a bit on react native animation and clojurescript. Noted it in ingress.

*** DONE Fix build process
    CLOSED: [2018-10-07 Sun 11:17]
    :LOGBOOK:
    CLOCK: [2018-10-06 Sat 11:45]--[2018-10-06 Sat 20:01] =>  8:16
    CLOCK: [2018-10-05 Fri 18:25]--[2018-10-05 Fri 19:35] =>  1:10
    CLOCK: [2018-10-05 Fri 18:23]--[2018-10-05 Fri 18:25] =>  0:02
    CLOCK: [2018-10-05 Fri 13:42]--[2018-10-05 Fri 13:59] =>  0:17
    :END:
- [X] Make a build from a new template
  - This build worked
- [X] Port over code
  - This build did not
- [X] Go through compiler options
- Figured out need to use =oops= instead of dot sytnax for interop
- changed built tested and repeated until I got it to build 

*** DONE Fix add-period-from-template
    CLOSED: [2018-10-27 Sat 15:26] SCHEDULED: <2018-10-19 Fri>
    :LOGBOOK:
    CLOCK: [2018-10-27 Sat 14:38]--[2018-10-27 Sat 15:26] =>  0:48
    :END:
It doesn't use start time
There was no bug, but I did fix some spacing and a time stamp view issue.

*** TODO Interesting idea for background processes

https://medium.com/@inkdrop/a-simple-way-to-run-js-in-background-thread-on-react-native-8fff345576da

*** CANCELED Refactor usage of =:dispatch=
    CLOSED: [2019-01-27 Sun 14:27]

Order cannot be guaranteed. Go through usages and refactor the dispatch to instead use the functions for those handlers 
directly in the handler that is trying to dispatch other events.

*** TODO Use cofx to insert uuid instead of putting (random-uuid) on dispatches
*** TODO Refactor specter selections and transformations into functions

Don't want all those path's defined over and over again.

*** TODO Move all modal visibility to app-state
*** TODO Add filters to select (period/template/bucket) modals
*** DONE Increase day selection button sizes
    CLOSED: [2018-12-02 Sun 16:31]
    :LOGBOOK:
    CLOCK: [2018-12-02 Sun 16:23]--[2018-12-02 Sun 16:31] =>  0:08
    CLOCK: [2018-12-02 Sun 16:12]--[2018-12-02 Sun 16:23] =>  0:11
    :END:

*** CANCELED Add filter option for time (today, tomorrow, this week)
    CLOSED: [2019-01-27 Sun 15:24]

*** DONE Initial Export
    CLOSED: [2018-12-03 Mon 19:53]
    :LOGBOOK:
    CLOCK: [2018-12-03 Mon 18:40]--[2018-12-03 Mon 19:53] =>  1:13
    CLOCK: [2018-12-03 Mon 16:23]--[2018-12-03 Mon 18:00] =>  1:37
    CLOCK: [2018-12-03 Mon 13:42]--[2018-12-03 Mon 14:20] =>  0:38
    :END:
Tried using FileSystem api from Expo but it is restricted to some kind of super locked down file system only within the Expo app.
Can't look at files outside of that isolation and can't write files outside.
Decided to go with Share api from react native. Export the app-db as a string to drive or whatever the user wants, email maybe.

*** TODO Import
    :LOGBOOK:
    CLOCK: [2018-12-03 Mon 18:00]--[2018-12-03 Mon 18:24] =>  0:24
    :END:
Eventually something cool like drop box integration.
Mostly likely a past text input for the app-db in edn or json, possibly a url to go grab it.
Might have to wait for a share reciever expo api, or detach.

*** CANCELED Fix cider after upgrading laptop
    CLOSED: [2019-01-25 Fri 20:10]
    :LOGBOOK:
    CLOCK: [2019-01-06 Sun 18:41]--[2019-01-06 Sun 20:46] =>  2:05
    CLOCK: [2019-01-06 Sun 18:23]--[2019-01-06 Sun 18:41] =>  0:18
    CLOCK: [2019-01-06 Sun 14:36]--[2019-01-06 Sun 16:00] =>  1:24
    CLOCK: [2019-01-05 Sat 20:38]--[2019-01-05 Sat 20:38] =>  0:00
    CLOCK: [2019-01-05 Sat 16:24]--[2019-01-05 Sat 20:38] =>  4:14
    CLOCK: [2018-12-16 Sun 14:00]--[2018-12-16 Sun 17:43] =>  3:43
    :END:

**** Stuff I should have done but didn't

 https://github.com/clojure-emacs/cider/blob/master/doc/troubleshooting.md
 - [ ] Check emacs version
   - [ ] new
   - [ ] old
 - [ ] Check emacs cider version
   - [ ] new 
   - [ ] old
 - [ ] Follow troubleshooting guide
 - [ ] Post an issue of all logs files to the cider github repo

**** Fixing the =cider-jack-in= problem

Noticed the versions of cider on my old dev setup where much older.
Bumped up everything that seemed related in project.clj
f1229ce90600cdda92daadd2bb8edb76526ff77f <--- commit

**** Fixing expo bundler connection problem
     :LOGBOOK:
     CLOCK: [2019-01-06 Sun 20:46]--[2019-01-06 Sun 22:21] =>  1:35
     :END:
#+begin_src bash
[20:33:28] goog.require could not find: figwheel.connect.build_main
[20:33:28] [Error: goog.require could not find: figwheel.connect.build_main]
#+end_src

**** Summary so far

Because of 
- lein having an nrepl version greater than 4
- spacemacs using bleeding edge clojure layer melpa packages
- exponent template using older figwheel and piggieback dependencies

I can't get /everything/ to work.

If i don't touch the dependencies in the project I can run `lein figwheel` it compiles and expo can bundle and serve to /an older version/ of the expo client.
But I can't cider-jack-in with spacemacs or run a lein repl. Spacemacs is using too new of cider and friends versions and lein has too high an nrepl version.

If I update the project dependencies then cider-jack-in will work but when I try to open the project in the expo client there is that expo bundler connection problem above.

Sane thing to do is go without a +real+ integrated repl. When a repl is needed jump onto the command line and hand type it in.

**** Lets try and understand what is happening
     :LOGBOOK:
     CLOCK: [2019-01-08 Tue 19:43]--[2019-01-08 Tue 21:31] =>  1:48
     :END:
Tried tracing through working backwrods from error.
Error is gotten by watching the expo bundler after starting fighweel (either cli with lein figwheel or with cider) and then opening the app.
It just says =Network request failed=.
Tried tracing through fighwheel bridge and searching that error but all my edits to figwheel bridge and node_modules don't show up in the app loading screen or the bundler console log.

*** CANCELED Attempt to upgrade expo template for new version of cider
    CLOSED: [2019-03-16 Sat 13:06]

**** Create a new project and verify it works
     :LOGBOOK:
     CLOCK: [2019-01-08 Tue 19:00]--[2019-01-08 Tue 19:21] =>  0:21
     :END:
#+begin_src bash
lein new expo cider-expo-test --reagent
# Add ip address to .lan-ip
lein figwheel
# In a separate command line
expo start --lan --no-dev
# Open app in expo client on device
#+end_src

**** Try to open a repl with spacemacs/cider
     :LOGBOOK:
     CLOCK: [2019-01-08 Tue 19:21]--[2019-01-08 Tue 19:32] =>  0:11
     :END:
#+begin_src 
SPC m i 
# select lein

# output
Warning: implicit middleware found: refactor-nrepl.plugin/middleware 
Please declare all middleware in :middleware as implicit loading is deprecated.
Warning: implicit middleware found: cider-nrepl.plugin/middleware 
Please declare all middleware in :middleware as implicit loading is deprecated.
[WARNING] No nREPL middleware descriptor in metadata of #'cemerick.piggieback/wrap-cljs-repl, see nrepl.middleware/set-descriptor!
[WARNING] No nREPL middleware descriptor in metadata of #'refactor-nrepl.middleware/wrap-refactor, see nrepl.middleware/set-descriptor!
nREPL server started on port 36141 on host localhost - nrepl://localhost:36141
ERROR: Unhandled REPL handler exception processing message {:op clone, :id 1}
java.lang.NullPointerException
	at clojure.core$deref_future.invokeStatic(core.clj:2292)
	at clojure.core$deref.invokeStatic(core.clj:2312)
	at clojure.core$deref.invoke(core.clj:2298)
	at cemerick.piggieback$wrap_cljs_repl$fn__23172.invoke(piggieback.clj:288)
	at clojure.tools.nrepl.middleware$wrap_conj_descriptor$fn__18110.invoke(middleware.clj:22)
	at nrepl.server$handle_STAR_.invokeStatic(server.clj:18)
	at nrepl.server$handle_STAR_.invoke(server.clj:15)
	at nrepl.server$handle$fn__22750.invoke(server.clj:27)
	at clojure.core$binding_conveyor_fn$fn__5476.invoke(core.clj:2022)
	at clojure.lang.AFn.call(AFn.java:18)
	at java.util.concurrent.FutureTask.run(FutureTask.java:266)
	at java.util.concurrent.ThreadPoolExecutor.runWorker(ThreadPoolExecutor.java:1149)
	at java.util.concurrent.ThreadPoolExecutor$Worker.run(ThreadPoolExecutor.java:624)
	at java.lang.Thread.run(Thread.java:748)

#+end_src

*** DONE Let's just try and get something running
    CLOSED: [2019-01-26 Sat 14:47]
    :LOGBOOK:
    CLOCK: [2019-01-26 Sat 12:48]--[2019-01-26 Sat 13:13] =>  0:25
    :END:

**** Current state

Code is on the last known working commit, nothing done to project deps regarding nrepl or figwheel.
This state used to be compiled and served to the emulator running expo client with ~lein figwheel~ and ~expo start --lan --no-dev~.
Now it results in an error on trying to load the compiled js bundle.
#+begin_src bash
[13:00:23] Metro Bundler failed to start. (code: ENOSPC)
[13:02:11] Running application "main" with appParams: {"initialProps":{"exp":{"lastErrors":[{"isFatal":false,"errorMessage":"Network request failed","exceptionId":1}],"initialUri":"exp://192.168.1.71:19000","manifest":{"iconUrl":"http://192.168.1.71:19001/assets/./assets/icons/app.png","isVerified":true,"debuggerHost":"192.168.1.71:19001","env":{},"icon":"./assets/icons/app.png","splash":{"resizeMode":"contain","backgroundColor":"#ffffff","image":"./assets/icons/loading.png","imageUrl":"http://192.168.1.71:19001/assets/./assets/icons/loading.png"},"logUrl":"http://192.168.1.71:19000/logs","privacy":"public","loadedFromCache":true,"primaryColor":"#cccccc","orientation":"portrait","description":"No description","bundleUrl":"http://192.168.1.71:19001/main.bundle?platform=android&dev=false&minify=false&hot=false&assetPlugin=%2Fhome%2Fjustin%2Fprojects%2Fcider-expo-test%2Fnode_modules%2Fexpo%2Ftools%2FhashAssetFiles.js","ios":{"supportsTablet":true},"packagerOpts":{"dev":false,"lanType":"ip","hostType":"lan","minify":false,"urlRandomness":"72-3nw"},"sdkVersion":"26.0.0","mainModuleName":"main","xde":true,"id":"@jgood/cider-expo-test","developer":{"tool":"expo-cli","projectRoot":"/home/justin/projects/cider-expo-test"},"name":"cider-expo-test","slug":"cider-expo-test","version":"1.0.0","hostUri":"192.168.1.71:19000"},"shell":false}},"rootTag":1}. __DEV__ === false, development-level warning are OFF, performance optimizations are ON
[13:02:11] Loading Closure base.
[13:02:11] Shimming require
[13:02:11] [TypeError: Network request failed]
#+end_src
This sucks.

**** Options
***** Test a fresh expo cljs template project

Keep all the default project deps in place. 
Keep system tools at the newest versions (expo-cli, lein, expo client).
If everything works discern differences.

***** Set up bare bones lumo compiled project and port

Follow this [[https://juxt.pro/blog/posts/native.html][bare bones tut]] to get a blank project up.
Figure out a bearable working environment.

***** Port the whole project back to a web app

This would be a lot of view changes.

**** Testing new cljs template
     :LOGBOOK:
     CLOCK: [2019-01-26 Sat 13:13]--[2019-01-26 Sat 14:47] =>  1:34
     :END:

***** System versions

Leiningen 2.8.3 on Java 1.8.0_191 OpenJDK 64-Bit Server VM
Expo-cli version: 2.7.0
Expo-client version: 2.10.4
Node version: v10.15.0
Npm version: 6.4.1

***** Setting up

#+begin_src bash
lein new expo basics +reagent
cd basics
yarn install
# manually add .lan-ip
lein figwheel
# in a separate tmux pane
expo start --lan --no-dev
#+end_src

***** Oh shit fix

Apparently something on my system is maxing out inotify (looking at you nextcloud && gitkraken).
That was impacting metro bundler. Found an esoteric error code in the web console for the bundler.
Googled it and ended up at this [[https://stackoverflow.com/questions/22475849/node-js-what-is-enospc-error-and-how-to-solve/32600959#32600959][stack overflow post]] that fixed the problem!

*** DONE Play with ui component library
    CLOSED: [2019-03-16 Sat 13:06]
    :LOGBOOK:
    CLOCK: [2019-01-28 Mon 21:09]--[2019-01-28 Mon 21:09] =>  0:00
    CLOCK: [2019-01-28 Mon 20:23]--[2019-01-28 Mon 21:08] =>  0:45
    CLOCK: [2019-01-26 Sat 20:11]--[2019-01-26 Sat 21:36] =>  1:25
    CLOCK: [2019-01-26 Sat 16:46]--[2019-01-26 Sat 16:46] =>  0:00
    CLOCK: [2019-01-26 Sat 15:10]--[2019-01-26 Sat 16:46] =>  1:36
    :END:
react-native-elements and react-natvie-ui-kitten fail to js/require >:(

*** DONE Fix selected indicator
    CLOSED: [2019-01-27 Sun 13:59]
    :LOGBOOK:
    CLOCK: [2019-01-27 Sun 13:10]--[2019-01-27 Sun 13:59] =>  0:49
    :END:

*** CANCELED Set up a custom minimal ui component library
    CLOSED: [2019-01-28 Mon 21:09]
    :LOGBOOK:
    CLOCK: [2019-01-28 Mon 20:00]--[2019-01-28 Mon 20:18] =>  0:18
    :END:

**** CANCELED Refactor =components/=
     CLOSED: [2019-01-28 Mon 20:23]
     :LOGBOOK:
     CLOCK: [2019-01-28 Mon 20:18]--[2019-01-28 Mon 20:23] =>  0:05
     :END:

*** DONE Update expo sdk
    CLOSED: [2019-03-16 Sat 13:06]
    :LOGBOOK:
    CLOCK: [2019-01-28 Mon 21:09]--[2019-01-28 Mon 22:12] =>  1:03
    :END:
This was brought on because trying to use ~react-native-elements~ caused an error because ~@expo/vector-icons~ was missing ~AntDesign~ set of icons when rne required it as a peer dep.
I checked expo vector icons github and saw a newer version had the set.
Updating to [[https://blog.expo.io/expo-sdk-30-0-0-is-now-available-e64d8b1db2a7][sdk-30]] because sdk-31 [[https://github.com/seantempesta/expo-cljs-template/issues/73][introduces some breakage]].

**** DONE If it aint one thing it is another
     CLOSED: [2019-03-16 Sat 13:06]

I jumped to expo 30 and the app was running but it didn't include the vector updates that rne needed.
Tried to jump to 32 but got a weird error about a missign metro/server index file. 
Attempted to clear caches like in the issue for skd-31 above but it didn't do anything.

**** DONE But wait, there's more...
     CLOSED: [2019-03-16 Sat 13:06]
     :LOGBOOK:
     CLOCK: [2019-02-27 Wed 18:41]--[2019-02-27 Wed 18:43] =>  0:02
     :END:
https://www.reddit.com/r/Clojure/comments/at8wkd/react_native_expo_with_shadowcljs/
Tried that out and it worked.

***** DONE Port project to shadow-cljs
      CLOSED: [2019-03-09 Sat 16:06]
      :LOGBOOK:
      CLOCK: [2019-03-02 Sat 14:48]--[2019-03-02 Sat 15:50] =>  1:02
      CLOCK: [2019-03-02 Sat 12:30]--[2019-03-02 Sat 13:00] =>  0:30
      CLOCK: [2019-02-28 Thu 09:47]--[2019-02-28 Thu 09:53] =>  0:06
      CLOCK: [2019-02-27 Wed 18:43]--[2019-02-27 Wed 19:33] =>  0:50
      :END:
- [X] Copy example project
- [X] Set up a repo
- [X] Rename
- [X] Add cljs deps
- [X] Attempt to [[https://github.com/thheller/shadow-cljs/wiki/Cider][get a repl]]
- [X] Figure out why repl doesn't work
  - Need to do things in this order
#+begin_src bash
shadow-cljs watch app
# separate command line process
yarn start
# in emacs editor
cider-connect (localhost:8202 or w/e the build says the nrepl is running on)
## Connect the client device and let it load javascript bundle
## +(cemerick.piggieback/cljs-repl :app) - this is an override I guess+
## actually just use (shadow/nrepl-select :app)
## Ready to evaluate
#+end_src
- [X] Add js deps
- [X] Start porting over code

****** DONE Get it running
       CLOSED: [2019-03-09 Sat 16:06]
       :LOGBOOK:
       CLOCK: [2019-03-09 Sat 13:28]--[2019-03-09 Sat 14:58] =>  1:30
       CLOCK: [2019-03-09 Sat 01:58]--[2019-03-09 Sat 01:58] =>  0:00
       CLOCK: [2019-03-08 Fri 23:44]--[2019-03-09 Sat 01:57] =>  2:13
       CLOCK: [2019-03-03 Sun 21:43]--[2019-03-03 Sun 22:30] =>  0:47
       CLOCK: [2019-03-03 Sun 15:50]--[2019-03-03 Sun 16:40] =>  0:50
       CLOCK: [2019-03-02 Sat 17:10]--[2019-03-02 Sat 17:48] =>  0:38
       CLOCK: [2019-03-02 Sat 15:50]--[2019-03-02 Sat 16:20] =>  0:30
       :END:

**** DONE Produce a build
     CLOSED: [2019-03-16 Sat 13:05]
     :LOGBOOK:
     CLOCK: [2019-03-16 Sat 13:04]--[2019-03-16 Sat 13:05] =>  0:01
     CLOCK: [2019-03-16 Sat 13:04]--[2019-03-16 Sat 13:04] =>  0:00
     CLOCK: [2019-03-09 Sat 18:20]--[2019-03-09 Sat 19:20] =>  1:00
     CLOCK: [2019-03-09 Sat 17:11]--[2019-03-09 Sat 17:45] =>  0:34
     :END:
Solution right now is not to use on ~shadow-cljs watch app~ to compile code not ~shadow-cljs release app~.
There were rumblings about suing a metro patch to fix the error that occurs with release.
Also consider using ~:infer-externs :auto~ in shadow build configuration.

***** Patch

 #+begin_src diff
 --- worker.js    2018-11-21 14:46:01.271844624 -0700
 +++ worker.js    2018-11-21 14:45:52.517615272 -0700
 @@ -218,7 +218,7 @@
      }
 
      if (!options.transformOptions.dev) {
 -      plugins.push([constantFoldingPlugin, opts]);
 +      // plugins.push([constantFoldingPlugin, opts]);
        plugins.push([inlinePlugin, opts]);
      }var _transformFromAstSync =
 #+end_src

*** DONE Auto create bucket filter for periods and templates
    CLOSED: [2019-03-09 Sat 16:50]
    :LOGBOOK:
    CLOCK: [2019-03-09 Sat 16:11]--[2019-03-09 Sat 16:50] =>  0:39
    :END:

*** DONE Reset default db
    CLOSED: [2019-03-09 Sat 17:11]
    :LOGBOOK:
    CLOCK: [2019-03-09 Sat 16:50]--[2019-03-09 Sat 17:11] =>  0:21
    :END:

*** DOSUB Overhaul style with react native elements
    :LOGBOOK:
    CLOCK: [2019-03-16 Sat 19:39]--[2019-03-16 Sat 19:40] =>  0:01
    CLOCK: [2019-03-16 Sat 13:08]--[2019-03-16 Sat 13:38] =>  0:30
    :END:
**** TODO Inputs on forms
     :LOGBOOK:
     CLOCK: [2019-03-17 Sun 16:34]--[2019-03-17 Sun 16:44] =>  0:10
     CLOCK: [2019-03-17 Sun 15:18]--[2019-03-17 Sun 16:29] =>  1:11
     CLOCK: [2019-03-17 Sun 14:27]--[2019-03-17 Sun 14:27] =>  0:00
     CLOCK: [2019-03-16 Sat 19:40]--[2019-03-16 Sat 21:26] =>  1:46
     :END:
   - [X] Bucket
   - [ ] Period
   - [ ] Template
   - [ ] Filter
   - [ ] Shared components

**** TODO Fix something I broke and then play with spec'ing functions
     :LOGBOOK:
     CLOCK: [2019-03-22 Fri 19:32]--[2019-03-22 Fri 20:41] =>  1:09
     :END:
**** DOSUB Day
     :LOGBOOK:
     CLOCK: [2019-03-23 Sat 18:43]--[2019-03-23 Sat 18:43] =>  0:00
     CLOCK: [2019-03-23 Sat 13:34]--[2019-03-23 Sat 14:48] =>  1:14
     CLOCK: [2019-03-23 Sat 13:09]--[2019-03-23 Sat 13:18] =>  0:09
     CLOCK: [2019-03-22 Fri 20:42]--[2019-03-22 Fri 22:07] =>  1:25
     :END:
The react components not re-rendering on saving is really annoying. Thinking about jumping back to PWA...
Had to refactor some stuff to make it easier to do visual design.
***** DONE Share space horizontally for overlapping periods
      CLOSED: [2019-04-15 Mon 18:01]
      :LOGBOOK:
      CLOCK: [2019-04-07 Sun 11:34]--[2019-04-07 Sun 12:39] =>  1:05
      CLOCK: [2019-03-31 Sun 14:34]--[2019-03-31 Sun 14:34] =>  0:00
      CLOCK: [2019-03-31 Sun 12:17]--[2019-03-31 Sun 14:34] =>  2:17
      CLOCK: [2019-03-30 Sat 18:39]--[2019-03-30 Sat 18:54] =>  0:15
      CLOCK: [2019-03-30 Sat 16:24]--[2019-03-30 Sat 17:18] =>  0:54
      CLOCK: [2019-03-30 Sat 15:12]--[2019-03-30 Sat 15:54] =>  0:42
      CLOCK: [2019-03-30 Sat 13:18]--[2019-03-30 Sat 13:56] =>  0:38
      CLOCK: [2019-03-30 Sat 11:21]--[2019-03-30 Sat 13:04] =>  1:43
      CLOCK: [2019-03-24 Sun 12:53]--[2019-03-24 Sun 12:56] =>  0:03
      CLOCK: [2019-03-23 Sat 18:44]--[2019-03-23 Sat 20:15] =>  1:31
      :END:
****** DONE Why does the repl die
       CLOSED: [2019-03-30 Sat 18:54]
       :LOGBOOK:
       CLOCK: [2019-03-30 Sat 15:54]--[2019-03-30 Sat 16:24] =>  0:30
       :END:
 Posted write up to zulip, slack, and github
 https://github.com/thheller/shadow-cljs/issues/469

******* Write up
  I've been trying to build out an app with [[https://github.com/thheller/reagent-expo][shadow-cljs expo]] example project.
  But the repl experience has been /painful/ so far.

  *Steps to reproduce my problem*

  In a terminal start up shadow with:
  #+begin_src bash
  $ shadow-cljs watch app
  #+end_src
  After /built/ message displays start up expo bundler with:
  #+begin_src bash
  $ expo start -c --lan --no-dev
  #+end_src
  Once that is ready to serve open the app in an emulator or physical device with the expo client.
  When the app loads then connect emacs/cider to the nrepl with `cider-connect` and select the nrepl output from shadow watch command, mine looked like this:
  #+begin_src bash
  shadow-cljs - nREPL server started on port 8202
  #+end_src
  In the cider connected repl run:
  #+begin_src clojure
  shadow.user> (shadow/nrepl-select :app)
  To quit, type: :cljs/quit
  [:selected :app]
  cljs.user> 
  #+end_src
  Now functions can be executed from the runtime on the device.
  #+begin_src clojure
  cljs.user> (+ 1 1)
  2
  cljs.user> (ns time-align-mobile.db)
  time-align-mobile.db
  time-align-mobile.db> (count (keys app-db))
  10
  time-align-mobile.db> (count (keys @re-frame.db/app-db))
  10
  #+end_src
  But if a compilation error is made, like referencing something that doesn't exist (common mistake):
  #+begin_src clojure
  10
  time-align-mobile.db> (does-not-exist :a :b)
  eval code
  eval@[native code]
  /data/user/0/host.exp.exponent/files/32.0.0/cached-bundle-experience-%40jgood%2Ftime-align-mobile713852404-32.0.0:81093:20
  shadow$cljs$devtools$client$env$repl_call@/data/user/0/host.exp.exponent/files/32.0.0/cached-bundle-experience-%40jgood%2Ftime-align-mobile713852404-32.0.0:80226:117
  shadow$cljs$devtools$client$react_native$repl_invoke@/data/user/0/host.exp.exponent/files/32.0.0/cached-bundle-experience-%40jgood%2Ftime-align-mobile713852404-32.0.0:81091:59
  shadow$cljs$devtools$client$react_native$handle_message@/data/user/0/host.exp.exponent/files/32.0.0/cached-bundle-experience-%40jgood%2Ftime-align-mobile713852404-32.0.0:81164:68
  shadow$cljs$devtools$client$env$process_ws_msg@/data/user/0/host.exp.exponent/files/32.0.0/cached-bundle-experience-%40jgood%2Ftime-align-mobile713852404-32.0.0:80373:113
  /data/user/0/host.exp.exponent/files/32.0.0/cached-bundle-experience-%40jgood%2Ftime-align-mobile713852404-32.0.0:81231:62
  dispatchEvent@/data/user/0/host.exp.exponent/files/32.0.0/cached-bundle-experience-%40jgood%2Ftime-align-mobile713852404-32.0.0:92416:31
  /data/user/0/host.exp.exponent/files/32.0.0/cached-bundle-experience-%40jgood%2Ftime-align-mobile713852404-32.0.0:94037:31
  emit@/data/user/0/host.exp.exponent/files/32.0.0/cached-bundle-experience-%40jgood%2Ftime-align-mobile713852404-32.0.0:82848:42
  __callFunction@/data/user/0/host.exp.exponent/files/32.0.0/cached-bundle-experience-%40jgood%2Ftime-align-mobile713852404-32.0.0:82305:49
  /data/user/0/host.exp.exponent/files/32.0.0/cached-bundle-experience-%40jgood%2Ftime-align-mobile713852404-32.0.0:82131:31
  __guard@/data/user/0/host.exp.exponent/files/32.0.0/cached-bundle-experience-%40jgood%2Ftime-align-mobile713852404-32.0.0:82259:15
  callFunctionReturnFlushedQueue@/data/user/0/host.exp.exponent/files/32.0.0/cached-bundle-experience-%40jgood%2Ftime-align-mobile713852404-32.0.0:82130:21
  callFunctionReturnFlushedQueue@[native code]
  #+end_src
  Then the nrepl dies and nothing can be executed:
  #+begin_src clojure
  time-align-mobile.db> (+ 1 1)
  REPL command timed out.
  time-align-mobile.db> 
  #+end_src
  The watching process and expo need to be restarted and cider re-connected :(
****** DONE More github issue stuff
       CLOSED: [2019-04-07 Sun 11:34]
 Added ~cider-nrepl~ to my global shadow-cljs config as per [[https://shadow-cljs.github.io/docs/UsersGuide.html#user-config][the user manual]].
 BTW this section
 #+begin_src clojure
 {:dependencies
  [[cider-nrepl "0.21.0"]]}
 #+end_src
 should be updated to
 #+begin_src clojure
 {:dependencies
  [[cider/cider-nrepl "0.21.1"]]}
 #+end_src

 Adding that removed an error message from the cider repl and added some auto complete functionality.
 After adding I'm running into an even worse problem.
 #+begin_src clojure
 WARNING: No Clojure project was detected. The
 refactor-nrepl middleware was not enabled. (You can mute this
 warning by customizing `cljr-suppress-no-project-warning'.)
 shadow.user> (shadow/nrepl-select :app)
 To quit, type: :cljs/quit
 [:selected :app]
 cljs.user> (+ 1 1)
 2
 cljs.user> (ns test.app)
 test.app
 test.app> (+ 1 1)
 REPL command timed out.
 test.app> 
 #+end_src
 Right after switching the namespace I noticed that the simulator refreshed the app.
 The bundler also threw an error
 #+begin_src bash
 WebSocket connected!                                                                      
 REPL init successful                                                                      
 encoding of result failed [TypeError: Cannot convert a symbol to a string] Object {       
   "render_root": [Function shadow$expo$render_root],                                      
   "root_component_ref": Object {                                                          
     "cljs$lang$protocol_mask$partition0$": 6455296,                                       
     "cljs$lang$protocol_mask$partition1$": 16386,                                         
     "meta": null,                                                                         
     "state": Object {                                                                     
       "__isMounted": true,      
 ... 
 #+end_src
****** DONE Think about the problem
       CLOSED: [2019-04-07 Sun 16:52]
       :LOGBOOK:
       CLOCK: [2019-04-07 Sun 12:39]--[2019-04-07 Sun 16:16] =>  3:37
       :END:
 There is a list time intervals.
 It is sorted by start time.
 #+begin_src clojure
 [ [0 3] [1 5] [5 6] [6 9] [7 8] [8 11] [20 23] ]
 #+end_src
 That input should result in this output.
 #+begin_src clojure
   [[[0 3] [1 5]]
    [[5 6]]
    [[6 9] [7 8] [8 11]]
    [[20 23]]]
 #+end_src

 Implementation
 #+begin_src clojure
   (require '[com.rpl.specter :as sp :refer-macros [select select-one setval transform]])

   (def intervals [ [0 3] [1 5] [5 6] [6 9] [7 8] [8 11] [20 23] ])

   (defn _overlaps? [start-a stop-a start-b stop-b]
     (and (< start-b stop-a)
          (< start-a stop-b)))

   (defn _interval-overlaps-collision-group?
     [interval collision-group]
     (some? (->> collision-group
                 (some #(_overlaps? (first interval)
                                    (second interval)
                                    (first %)
                                    (second %))))))

   (defn _fn [result interval]
     (let [result-fixed (if (empty? (last result))
                          result
                          (conj result []))]

       (setval

        (sp/cond-path
         [sp/ALL (partial _interval-overlaps-collision-group? interval)]
         [sp/ALL (partial _interval-overlaps-collision-group? interval) sp/AFTER-ELEM]

         [sp/ALL empty?]
         [sp/ALL empty? sp/AFTER-ELEM])

        interval
        result-fixed)))

   (reduce _fn [[]] intervals)
 #+end_src
****** DONE Non optimized sharing
       CLOSED: [2019-04-15 Mon 17:34]
       :LOGBOOK:
       CLOCK: [2019-04-15 Mon 17:24]--[2019-04-15 Mon 17:34] =>  0:10
       CLOCK: [2019-04-15 Mon 16:51]--[2019-04-15 Mon 17:05] =>  0:14
       CLOCK: [2019-04-15 Mon 16:51]--[2019-04-15 Mon 16:51] =>  0:00
       CLOCK: [2019-04-08 Mon 08:42]--[2019-04-08 Mon 09:15] =>  0:33
       :END:
****** DONE Test that it works for planned side
       CLOSED: [2019-04-15 Mon 18:00]
       :LOGBOOK:
       CLOCK: [2019-04-15 Mon 18:00]--[2019-04-15 Mon 18:00] =>  0:00
       :END:
***** TODO Floating action button for playing
      :LOGBOOK:
      CLOCK: [2019-04-15 Mon 18:23]--[2019-04-15 Mon 18:48] =>  0:25
      :END:
***** TODO Better button menu
*** TODO Fix production builds

Solution right now is not to use on ~shadow-cljs watch app~ to compile code not ~shadow-cljs release app~.
There were rumblings about suing a metro patch to fix the error that occurs with release.
Also consider using ~:infer-externs :auto~ in shadow build configuration.

***** Patch

 #+begin_src diff
 --- worker.js    2018-11-21 14:46:01.271844624 -0700
 +++ worker.js    2018-11-21 14:45:52.517615272 -0700
 @@ -218,7 +218,7 @@
      }
 
      if (!options.transformOptions.dev) {
 -      plugins.push([constantFoldingPlugin, opts]);
 +      // plugins.push([constantFoldingPlugin, opts]);
        plugins.push([inlinePlugin, opts]);
      }var _transformFromAstSync =
 #+end_src

*** DONE Fix hot reloading
    CLOSED: [2019-03-23 Sat 13:09]
    :LOGBOOK:
    CLOCK: [2019-03-23 Sat 12:23]--[2019-03-23 Sat 13:09] =>  0:46
    :END:
*** DONE Figure out why nrepl doesn't work
    CLOSED: [2019-04-06 Sat 23:04]
    :LOGBOOK:
    CLOCK: [2019-04-06 Sat 21:45]--[2019-04-06 Sat 23:04] =>  1:34
    CLOCK: [2019-04-06 Sat 10:30]--[2019-04-06 Sat 10:51] =>  0:21
    CLOCK: [2019-04-05 Fri 19:56]--[2019-04-05 Fri 20:53] =>  0:57
    CLOCK: [2019-04-04 Thu 20:52]--[2019-04-04 Thu 21:42] =>  0:50
    CLOCK: [2019-04-03 Wed 18:30]--[2019-04-03 Wed 19:55] =>  1:25
    CLOCK: [2019-04-01 Mon 22:02]--[2019-04-01 Mon 23:24] =>  1:22
    :END:
https://github.com/thheller/shadow-cljs/issues/469
That thread explains everything.
Basically I'm an idiot...
**** Test out different expo starts
- expo started normally
  - changing namespace reloads the app and breaks the repl
- expo started ~--no-dev~ 
  - changing namespace works but errors (boom) relaods the app and breaks the repl (tested twice)
- expo started ~--no-dev~ and production mode off in the web ui 
  - changing namespace reloads the app and breaks the repl (tested twice)
- expo started ~-c --no-dev~ and production mode on
  - changing namespace works but errors (boom) reloads the app and breaks the repl
- expo started ~-c --no-dev~ and production mode off
  - changing namespace reloads the app and break teh repl
***** Make a table
|      | expo start | expo start --no-dev | expo start --no-dev (production mode off) |
|------+------------+---------------------+-------------------------------------------+
| ns   | reloads    | works               | changing namespace reloads the app        |
| boom | reloads    | reloads             | reloads                                   |

*** DONE Update readme
    CLOSED: [2019-04-07 Sun 11:31]
    :LOGBOOK:
    CLOCK: [2019-04-07 Sun 10:55]--[2019-04-07 Sun 11:31] =>  0:36
    :END:
*** TODO Multiple in-play at once
*** TODO Migrations of app-db
** DOSUB Dog food
*** DONE Add now indicator
    CLOSED: [2018-12-07 Fri 00:32]
    :LOGBOOK:
    CLOCK: [2018-12-07 Fri 00:22]--[2018-12-07 Fri 00:32] =>  0:10
    :END:

*** DONE Monospaced font && syntax highlighting in data
    CLOSED: [2018-12-07 Fri 00:22]
    :LOGBOOK:
    CLOCK: [2018-12-06 Thu 22:59]--[2018-12-07 Fri 00:22] =>  1:23
    CLOCK: [2018-12-05 Wed 20:39]--[2018-12-05 Wed 21:42] =>  1:03
    CLOCK: [2018-12-05 Wed 19:57]--[2018-12-05 Wed 20:07] =>  0:10
    :END:
https://www.npmjs.com/package/react-native-syntax-highlighter
Why can't I require this!
Starting looking into the difference between commonjs modules and es6 (among other types).
Tried to identify what type this dep was.
Didn't find anything directly applicable.
Tried requiring it again and it worked. I guess I just needed to restart or something.
Then realized this comp is only for viewing code... not editing it.
Back to just adding monospaced font.

*** DONE Add things from the day view
    CLOSED: [2018-12-09 Sun 19:17]
    :LOGBOOK:
    CLOCK: [2018-12-09 Sun 19:13]--[2018-12-09 Sun 19:16] =>  0:03
    CLOCK: [2018-12-09 Sun 18:43]--[2018-12-09 Sun 18:44] =>  0:01
    CLOCK: [2018-12-09 Sun 15:26]--[2018-12-09 Sun 16:19] =>  0:53
    CLOCK: [2018-12-09 Sun 00:00]--[2018-12-09 Sun 00:27] =>  0:27
    CLOCK: [2018-12-08 Sat 22:57]--[2018-12-08 Sat 23:43] =>  0:46
    CLOCK: [2018-12-08 Sat 20:47]--[2018-12-08 Sat 22:32] =>  1:45
    :END:
- [X] Figure out how to turn a touch event into a date
- [X] Refactor some handler stuff to actually start creating a period from a touch event
- [X] Remove info and make selection menu all buttons so they are big enough to press
- [X] Change selection indicator because I don't know what I'm actually selecting
- [X] Add time indicators
- [-] Create a bucket selection modal
- [X] Alter add-period handler to take nil bucket-id
- [X] Dispatch =:add-period=, +=:load-period-form=,+ and =:navigate-to=

*** DONE Fix spacing on data
    CLOSED: [2018-12-09 Sun 20:29]
    :LOGBOOK:
    CLOCK: [2018-12-09 Sun 19:18]--[2018-12-09 Sun 20:29] =>  1:11
    :END:
Use zprint width and other options

*** TODO Make data collapsible
*** TODO Default filters

- today
- planned
- actual

*** TODO Stackable filters
*** TODO Preserve ordering of data keys
*** TODO Data view modal on info section
*** TODO Quick add on day view

- Modals for selecting bucket or templates
- Press and drag for duration

*** TODO Add bucket color in selection on period form
*** TODO Add duration indication to period form (graphical?)
*** CANCELED Turn a period into a template
    CLOSED: [2019-04-26 Fri 22:49]
Duplicate
*** DONE Make selection border slightly transparent
    CLOSED: [2019-01-26 Sat 17:46]
    :LOGBOOK:
    CLOCK: [2019-01-26 Sat 16:48]--[2019-01-26 Sat 17:46] =>  0:58
    :END:
Moved the border instead.

*** TODO Move end to now
*** TODO Add exit to modals
*** TODO Play from new vs play from end
*** TODO Play from should change displayed day
*** TODO Add port indicator

The export dialog takes awhile to pop up.

*** TODO Create template from period
*** TODO Play from id added to new period
*** TODO Snap to hour and surrounding periods
*** TODO Free text or better data

Maybe checklists that are easy to get to

*** TODO Copy to next (today?) day plan
*** TODO From last to now
*** TODO Play button outside selection
*** TODO Notifications

Get notified with options to adjust plan (snooze) or start a timer.

*** TODO Dont show stop time when in play
*** DONE Reduce ticking or pull it out of a re-frame event
    CLOSED: [2019-01-27 Sun 19:36]

Reduced it

*** TODO Select closest period

Convert touch to time and select the closest period.

*** TODO Add as start now or as stop now
*** TODO Things hard to do

- make new buckets
- make new templates
- add a template to now
- stretch shrink a period
See

*** TODO Order tamplates by last usage or edit
*** TODO Entry ui

Long press to activate. Drag and release to set start, drag and release to set stop.

*** TODO Insert and shift

Start on start and shift down or stop on stop and shift up

*** TODO Zoom in
*** TODO Jump to start stop
*** TODO Template group

A group of period templates that can be added at the same time.

*** TODO New starting after/ending  before
*** DONE Task doesn't show when it is more than a day long
    CLOSED: [2019-04-26 Fri 22:50]
*** DONE Secure store over wrote on a crashed app?
    CLOSED: [2019-01-26 Sat 15:09]
    :LOGBOOK:
    CLOCK: [2019-01-26 Sat 14:59]--[2019-01-26 Sat 15:08] =>  0:09
    CLOCK: [2019-01-26 Sat 14:48]--[2019-01-26 Sat 14:48] =>  0:00
    CLOCK: [2019-01-25 Fri 20:36]--[2019-01-25 Fri 20:36] =>  0:00
    :END:
Turned on spec... not sure what else to do.
A db import is the only real solution. That is noted elsewhere.

*** DONE Change bottom play tobplay from when selected
    CLOSED: [2019-04-17 Wed 16:22]
    :LOGBOOK:
    CLOCK: [2019-04-17 Wed 16:17]--[2019-04-17 Wed 16:22] =>  0:05
    :END:
*** TODO Jump to playing when another period is selected
*** TODO Jump to today
*** TODO Cancel add period on each modal
*** TODO Back button should navigate to last screen
    :LOGBOOK:
    CLOCK: [2018-08-18 Sat 14:51]--[2018-08-18 Sat 14:56] =>  0:05
    :END:
https://github.com/Day8/re-frame-undo
https://facebook.github.io/react-native/docs/backhandler#docsNav

*** TODO Better start stop indicator on day view

Remove the start, and stop from the button section.
Add horizontal bars (like the now indicator) sandwiching the period with ~hh:mm~ on them.

*** TODO Remove offset from time stamp form fields
*** TODO Show only first six digits of id with a modal on press for the full value
    :LOGBOOK:
    CLOCK: [2019-03-17 Sun 16:29]--[2019-03-17 Sun 16:29] =>  0:00
    :END:

*** DOSUB [#A] Template a day
    :LOGBOOK:
    CLOCK: [2019-04-19 Fri 16:30]--[2019-04-19 Fri 16:47] =>  0:17
    CLOCK: [2019-04-17 Wed 17:19]--[2019-04-17 Wed 17:19] =>  0:00
    CLOCK: [2019-04-17 Wed 16:23]--[2019-04-17 Wed 16:33] =>  0:10
    CLOCK: [2019-04-16 Tue 13:30]--[2019-04-16 Tue 14:30] =>  1:00
    :END:
**** DONE Attempted implementation before sketching
     CLOSED: [2019-04-19 Fri 17:36]
***** DONE Add to db
      CLOSED: [2019-04-19 Fri 16:46]
      :LOGBOOK:
      CLOCK: [2019-04-17 Wed 19:01]--[2019-04-17 Wed 19:43] =>  0:42
      CLOCK: [2019-04-17 Wed 17:48]--[2019-04-17 Wed 17:57] =>  0:09
      CLOCK: [2019-04-17 Wed 17:19]--[2019-04-17 Wed 17:28] =>  0:09
      :END:
***** DONE Handlers
      CLOSED: [2019-04-19 Fri 16:46]
      :LOGBOOK:
      CLOCK: [2019-04-18 Thu 11:37]--[2019-04-18 Thu 12:40] =>  1:03
      CLOCK: [2019-04-18 Thu 09:48]--[2019-04-18 Thu 10:27] =>  0:39
      CLOCK: [2019-04-17 Wed 22:01]--[2019-04-17 Wed 22:01] =>  0:00
      CLOCK: [2019-04-17 Wed 21:04]--[2019-04-17 Wed 22:01] =>  0:57
      :END:
***** DONE Subscriptions
      CLOSED: [2019-04-19 Fri 17:36]
      :LOGBOOK:
      CLOCK: [2019-04-19 Fri 16:47]--[2019-04-19 Fri 17:36] =>  0:49
      CLOCK: [2019-04-18 Thu 18:32]--[2019-04-18 Thu 18:38] =>  0:06
      :END:
**** DOSUB After sketch 
***** DONE Pattern form
      CLOSED: [2019-04-22 Mon 22:03]
****** DONE Navigation
       CLOSED: [2019-04-22 Mon 21:57]
       :LOGBOOK:
       CLOCK: [2019-04-22 Mon 21:08]--[2019-04-22 Mon 21:08] =>  0:00
       CLOCK: [2019-04-20 Sat 22:07]--[2019-04-20 Sat 22:31] =>  0:24
       :END:
****** DONE Form screen
       CLOSED: [2019-04-22 Mon 21:57]
       :LOGBOOK:
       CLOCK: [2019-04-22 Mon 21:08]--[2019-04-22 Mon 21:57] =>  0:49
       :END:
****** DONE Form in db
       CLOSED: [2019-04-22 Mon 21:58]
****** DONE Form handlers
       CLOSED: [2019-04-22 Mon 22:03]
       :LOGBOOK:
       CLOCK: [2019-04-22 Mon 21:58]--[2019-04-22 Mon 21:58] =>  0:00
       :END:
***** DONE Patterns list
      CLOSED: [2019-04-22 Mon 22:37]
      :LOGBOOK:
      CLOCK: [2019-04-19 Fri 17:36]--[2019-04-19 Fri 17:36] =>  0:00
      :END:
****** DONE Subscription
       CLOSED: [2019-04-19 Fri 17:46]
       :LOGBOOK:
       CLOCK: [2019-04-19 Fri 17:36]--[2019-04-19 Fri 17:46] =>  0:10
       :END:
****** DONE Make a screen
       CLOSED: [2019-04-19 Fri 19:08]
       :LOGBOOK:
       CLOCK: [2019-04-19 Fri 18:26]--[2019-04-19 Fri 19:08] =>  0:42
       :END:
****** DONE Wire up the screen buttons
       CLOSED: [2019-04-22 Mon 22:36]
Need to add pattern form screen first
******* DONE Add
        CLOSED: [2019-04-22 Mon 22:36]
        :LOGBOOK:
        CLOCK: [2019-04-22 Mon 22:33]--[2019-04-22 Mon 22:36] =>  0:03
        CLOCK: [2019-04-22 Mon 22:04]--[2019-04-22 Mon 22:06] =>  0:02
        :END:
******* DONE Click on item
        CLOSED: [2019-04-22 Mon 22:04]
****** CANCELED Template
       CLOSED: [2019-04-22 Mon 22:37]
I don't know what this was for
***** DONE Templates?
      CLOSED: [2019-04-22 Mon 23:20]
      :LOGBOOK:
      CLOCK: [2019-04-22 Mon 22:39]--[2019-04-22 Mon 23:20] =>  0:41
      :END:
***** TODO Planning
      :LOGBOOK:
      CLOCK: [2019-05-05 Sun 14:45]--[2019-05-05 Sun 16:11] =>  1:26
      CLOCK: [2019-05-04 Sat 15:27]--[2019-05-04 Sat 17:26] =>  1:59
      CLOCK: [2019-05-04 Sat 12:53]--[2019-05-04 Sat 13:45] =>  0:52
      CLOCK: [2019-05-04 Sat 12:09]--[2019-05-04 Sat 12:12] =>  0:03
      CLOCK: [2019-04-28 Sun 20:03]--[2019-04-28 Sun 20:39] =>  0:36
      CLOCK: [2019-04-28 Sun 17:57]--[2019-04-28 Sun 18:51] =>  0:54
      CLOCK: [2019-04-28 Sun 15:00]--[2019-04-28 Sun 15:03] =>  0:03
      CLOCK: [2019-04-28 Sun 14:53]--[2019-04-28 Sun 14:59] =>  0:06
      CLOCK: [2019-04-28 Sun 12:48]--[2019-04-28 Sun 13:14] =>  0:26
      CLOCK: [2019-04-28 Sun 11:45]--[2019-04-28 Sun 12:22] =>  0:37
      CLOCK: [2019-04-27 Sat 19:33]--[2019-04-27 Sat 20:27] =>  0:54
      CLOCK: [2019-04-27 Sat 18:07]--[2019-04-27 Sat 18:26] =>  0:19
      CLOCK: [2019-04-27 Sat 16:29]--[2019-04-27 Sat 16:30] =>  0:01
      CLOCK: [2019-04-27 Sat 15:35]--[2019-04-27 Sat 15:37] =>  0:02
      CLOCK: [2019-04-27 Sat 14:32]--[2019-04-27 Sat 14:47] =>  0:15
      CLOCK: [2019-04-26 Fri 22:17]--[2019-04-26 Fri 23:47] =>  1:30
      CLOCK: [2019-04-25 Thu 21:40]--[2019-04-25 Thu 22:21] =>  0:41
      CLOCK: [2019-04-24 Wed 21:15]--[2019-04-24 Wed 23:37] =>  2:22
      CLOCK: [2019-04-23 Tue 16:39]--[2019-04-23 Tue 17:38] =>  0:59
      CLOCK: [2019-04-23 Tue 16:15]--[2019-04-23 Tue 16:16] =>  0:01
      CLOCK: [2019-04-23 Tue 15:52]--[2019-04-23 Tue 16:00] =>  0:08
      CLOCK: [2019-04-23 Tue 14:05]--[2019-04-23 Tue 14:37] =>  0:32
      :END:
- [X] Screen stub
- [ ] Nav
  - [X] Navigation.cljs
  - [ ] Handlers ~:navigate-to~
    - Might have to one day load the form again
  - [X] Temporary drawer item
- [X] Subs
- [ ] Screen
  - [X] Dimension awareness
  - [X] Time indicators
  - [X] Template rendering
  - [X] Top bar (pattern label)
  - [ ] Bottom bar
    - [X] Back to pattern form
    - [X] Save pattern form
      - [X] Get pattern form changes sub
        - It was already done
    - [ ] Apply pattern form to day
  - [X] Selection menu
    - [X] Ability to select
    - [X] Selection menu buttons
      - [X] Copy over relevant day buttons
      - [X] Translate period buttons to pattern form updates
        - [X] Fix template start/stop data model
          - Should probably be ms of 24 hours and then parse into a date time
          - [X] Update app.db specs and default
          - [X] Handlers
          - [X] Search ~start~ ~stop~
          - [X] Compile it
          - [X] Functional test
        - [X] Rest of the buttons
          - [X] Select next or prev button
            - [X] Fix template form
              - [X] Start stop comps
              - [X] Bucket label parent picker comp
            - [X] Test in repl
- [ ] Pattern form component (link to screen)
- [ ] Apply pattern to day in ?pattern list?
- [ ] Remove stub menu entry
*** TODO Put something between two selected periods
*** TODO Plugin style other app linking (walking amd strava)
*** TODO Move left and right (next prev day)
*** TODO Template groups relative start

Either have all start times be absolute or relative. Maybe an option when creating the group.

*** TODO Long press to place a default

Long pressing shouldn't bring you to the edit screen, double tapping should.

** DOSUB Predicting
*** TODO look into markov chains
** DONE Expo vs PWA
   CLOSED: [2019-03-23 Sat 13:34]
   :LOGBOOK:
   CLOCK: [2019-03-31 Sun 14:43]--[2019-03-31 Sun 14:50] =>  0:07
   CLOCK: [2019-03-23 Sat 13:24]--[2019-03-23 Sat 13:34] =>  0:10
   :END:
|      | Expo                     | PWA                                           |
|------+--------------------------+-----------------------------------------------|
| Pros | No hosting to distribute | Better tool integration                       |
|      | Similar to work          | Better material design library                |
|      |                          | /Battle/ tested in production                 |
|      |                          | No potential for payment blockage             |
|      |                          | Aligns with ideals (protocols over platforms) |
|      |                          |                                               |
| Cons | Apple store              | No notifications for ios                      |
|      |                          | Starting over                                 |
|      |                          | Have to learn how to service worker           |
|      |                          |                                               |
<2019-03-23 Sat> Net point is 1 for each ... guess I stay where I am rn
<2019-03-31 Sun> Net point is 1 vs 2, time to switch back to PWA?
** DOSUB Technical debt
*** TODO Fully namespaced keywords
This is needed for serious refactoring
*** TODO Unit tests
- handlers
- subscriptions
- helper functions
*** TODO Spec'd functions
Opens up for better dev experience and generative testing
